artillery.yaml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up

before:
  flow:
    - post:
        url: "/login"
        json:
          login: "admin"
          password: "admin"
        capture:
          - json: $.token
            as: token

scenarios:
  - name: "Users crud"
    flow:
      - post:
          url: "/users"
          headers:
            authorization: "Bearer {{ token }}"
          json:
            name: "jessie"
            login: "jess"
            password: "12345678"
          capture:
            json: $.id
            as: userId
      - get:
          url: "/users"
          headers:
            authorization: "Bearer {{ token }}"
      - get:
          url: "/users/{{userId}}"
          headers:
            authorization: "Bearer {{ token }}"
      - put:
          url: "/users/{{userId}}"
          headers:
            authorization: "Bearer {{ token }}"
          json:
            password: "qwertyuio"
      - delete:
          url: "/users/{{userId}}"
          headers:
            authorization: "Bearer {{ token }}"